#+title: Oddlamma Install Gentoo

* Adjusting make.conf
Check how many cores the system has:

#+begin_src sh
# note that BSDs including mac have sysctl -n hw.ncpu
grep -c '^processor' /proc/cpuinfo 2>/dev/null ||\
    lscpu
#+end_src

#+RESULTS:
: 12

Adjust the =/etc/portage/make.conf= accordingly:

#+begin_src sh
# Consider adding march native if this system won't be shared among devices or
# act as a bin host
COMMON_FLAGS="-O2 -pipe"
COMMON_FLAGS="-O2 -pipe -march=native"


# default to binary packages
FEATURES="getbinpkg"
# After the system is stable, ensure binaries are signed correctly (enable this
# after, otherwise the keyring can get confused moving between machines)
FEATURES="${FEATURES} binpkg-request-signature"

# Use all cores while compilingw
MAKEOPTS="--jobs 12 --load 13"

# Consider caching built packages
FEATURES="${FEATURES} buildpkg"
#+end_src


